QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/i2c.h
#ifndef I2C_H
#define I2C_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

//*****************************************************************************
//
//! \addtogroup i2c_api I2C
//! @{
//
//*****************************************************************************

#include "inc/hw_i2c.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"
#include "hw_reg_inclusive_terminology.h"

//*****************************************************************************
//
// Defines for the API.
//
//*****************************************************************************

#ifndef DOXYGEN_PDF_IGNORE
//*****************************************************************************
//
// I2C Controller commands.
//
//*****************************************************************************
#define I2C_CONTROLLER_SEND_MODE    0x0600U //!< Controller-transmitter mode
#define I2C_CONTROLLER_RECEIVE_MODE 0x0400U //!< Controller-receiver mode
#define I2C_TARGET_SEND_MODE        0x0200U //!< Target-transmitter mode
#define I2C_TARGET_RECEIVE_MODE     0x0000U //!< Target-receiver mode

#define I2C_REPEAT_MODE      0x0080U //!< Only applies to Controller mode
#define I2C_START_BYTE_MODE  0x0010U //!< Enable start byte mode
#define I2C_FREE_DATA_FORMAT 0x0008U //!< Enable free data (no addr) format

//*****************************************************************************
//
// I2C interrupts for use with the intFlags parameter of I2C_enableInterrupt(),
// I2C_disableInterrupt(), and I2C_clearInterruptStatus() and to be returned by
// I2C_getInterruptStatus().
//
//*****************************************************************************
#define I2C_INT_ARB_LOST       0x00001U //!< Arbitration-lost interrupt
#define I2C_INT_NO_ACK         0x00002U //!< NACK interrupt
#define I2C_INT_REG_ACCESS_RDY 0x00004U //!< Register-access-ready interrupt
#define I2C_INT_RX_DATA_RDY    0x00008U //!< Receive-data-ready interrupt
#define I2C_INT_TX_DATA_RDY    0x00010U //!< Transmit-data-ready interrupt
#define I2C_INT_STOP_CONDITION 0x00020U //!< Stop condition detected
#define I2C_INT_ADDR_TARGET    0x00200U //!< Addressed as target interrupt
#define I2C_INT_RXFF           0x10000U //!< RX FIFO level interrupt
#define I2C_INT_TXFF           0x20000U //!< TX FIFO level interrupt

//
// Helpful define to mask out the bits in the I2CSTR register that aren't
// associated with interrupts.
//

#define I2C_STR_INTMASK                                                                       \
    ((uint16_t)I2C_INT_ARB_LOST | (uint16_t)I2C_INT_NO_ACK | (uint16_t)I2C_INT_REG_ACCESS_RDY \
        | (uint16_t)I2C_INT_RX_DATA_RDY | (uint16_t)I2C_INT_TX_DATA_RDY                       \
        | (uint16_t)I2C_INT_STOP_CONDITION | (uint16_t)I2C_INT_ADDR_TARGET)

//*****************************************************************************
//
// Flags for use as the stsFlags parameter of I2C_clearStatus() and to be
// returned by I2C_getStatus().
//
//*****************************************************************************
#define I2C_STS_ARB_LOST       0x0001U //!< Arbitration-lost
#define I2C_STS_NO_ACK         0x0002U //!< No-acknowledgment (NACK)
#define I2C_STS_REG_ACCESS_RDY 0x0004U //!< Register-access-ready (ARDY)
#define I2C_STS_RX_DATA_RDY    0x0008U //!< Receive-data-ready
#define I2C_STS_TX_DATA_RDY    0x0010U //!< Transmit-data-ready
#define I2C_STS_STOP_CONDITION 0x0020U //!< Stop condition detected
#define I2C_STS_ADDR_ZERO      0x0100U //!< Address of all zeros detected
#define I2C_STS_ADDR_TARGET    0x0200U //!< Addressed as target
#define I2C_STS_TX_EMPTY       0x0400U //!< Transmit shift register empty
#define I2C_STS_RX_FULL        0x0800U //!< Receive shift register full
#define I2C_STS_BUS_BUSY       0x1000U //!< Bus busy, wait for STOP or reset
#define I2C_STS_NACK_SENT      0x2000U //!< NACK was sent
#define I2C_STS_TARGET_DIR     0x4000U //!< Addressed as target transmitter

#endif

//*****************************************************************************
//
//! I2C interrupts to be returned by I2C_getInterruptSource().
//
//*****************************************************************************
typedef enum
{
    I2C_INTSRC_NONE,           //!< No interrupt pending
    I2C_INTSRC_ARB_LOST,       //!< Arbitration-lost interrupt
    I2C_INTSRC_NO_ACK,         //!< NACK interrupt
    I2C_INTSRC_REG_ACCESS_RDY, //!< Register-access-ready interrupt
    I2C_INTSRC_RX_DATA_RDY,    //!< Receive-data-ready interrupt
    I2C_INTSRC_TX_DATA_RDY,    //!< Transmit-data-ready interrupt
    I2C_INTSRC_STOP_CONDITION, //!< Stop condition detected
    I2C_INTSRC_ADDR_TARGET,    //!< Addressed as target interrupt
} I2C_InterruptSource;

//*****************************************************************************
//
//! Values that can be passed to I2C_setFIFOInterruptLevel() as the \e txLevel
//! parameter, returned by I2C_getFIFOInterruptLevel() in the \e txLevel
//! parameter, and returned by I2C_getTxFIFOStatus().
//
//*****************************************************************************
typedef enum
{
    I2C_FIFO_TXEMPTY = 0x0000U, //!< Transmit FIFO empty
    I2C_FIFO_TX0     = 0x0000U, //!< Transmit FIFO empty
    I2C_FIFO_TX1     = 0x0001U, //!< Transmit FIFO 1/16 full
    I2C_FIFO_TX2     = 0x0002U, //!< Transmit FIFO 2/16 full
    I2C_FIFO_TX3     = 0x0003U, //!< Transmit FIFO 3/16 full
    I2C_FIFO_TX4     = 0x0004U, //!< Transmit FIFO 4/16 full
    I2C_FIFO_TX5     = 0x0005U, //!< Transmit FIFO 5/16 full
    I2C_FIFO_TX6     = 0x0006U, //!< Transmit FIFO 6/16 full
    I2C_FIFO_TX7     = 0x0007U, //!< Transmit FIFO 7/16 full
    I2C_FIFO_TX8     = 0x0008U, //!< Transmit FIFO 8/16 full
    I2C_FIFO_TX9     = 0x0009U, //!< Transmit FIFO 9/16 full
    I2C_FIFO_TX10    = 0x000AU, //!< Transmit FIFO 10/16 full
    I2C_FIFO_TX11    = 0x000BU, //!< Transmit FIFO 11/16 full
    I2C_FIFO_TX12    = 0x000CU, //!< Transmit FIFO 12/16 full
    I2C_FIFO_TX13    = 0x000DU, //!< Transmit FIFO 13/16 full
    I2C_FIFO_TX14    = 0x000EU, //!< Transmit FIFO 14/16 full
    I2C_FIFO_TX15    = 0x000FU, //!< Transmit FIFO 15/16 full
    // I2C_FIFO_TX16    = 0x0010U, //!< Transmit FIFO full
    I2C_FIFO_TXFULL = 0x000FU //!< Transmit FIFO full
} I2C_TxFIFOLevel;

//*****************************************************************************
//
//! Values that can be passed to I2C_setFIFOInterruptLevel() as the \e rxLevel
//! parameter, returned by I2C_getFIFOInterruptLevel() in the \e rxLevel
//! parameter, and returned by I2C_getRxFIFOStatus().
//
//*****************************************************************************
typedef enum
{
    I2C_FIFO_RXEMPTY = 0x0000U, //!< Receive FIFO empty
    I2C_FIFO_RX0     = 0x0000U, //!< Receive FIFO empty
    I2C_FIFO_RX1     = 0x0001U, //!< Receive FIFO 1/16 full
    I2C_FIFO_RX2     = 0x0002U, //!< Receive FIFO 2/16 full
    I2C_FIFO_RX3     = 0x0003U, //!< Receive FIFO 3/16 full
    I2C_FIFO_RX4     = 0x0004U, //!< Receive FIFO 4/16 full
    I2C_FIFO_RX5     = 0x0005U, //!< Receive FIFO 5/16 full
    I2C_FIFO_RX6     = 0x0006U, //!< Receive FIFO 6/16 full
    I2C_FIFO_RX7     = 0x0007U, //!< Receive FIFO 7/16 full
    I2C_FIFO_RX8     = 0x0008U, //!< Receive FIFO 8/16 full
    I2C_FIFO_RX9     = 0x0009U, //!< Receive FIFO 9/16 full
    I2C_FIFO_RX10    = 0x000AU, //!< Receive FIFO 10/16 full
    I2C_FIFO_RX11    = 0x000BU, //!< Receive FIFO 11/16 full
    I2C_FIFO_RX12    = 0x000CU, //!< Receive FIFO 12/16 full
    I2C_FIFO_RX13    = 0x000DU, //!< Receive FIFO 13/16 full
    I2C_FIFO_RX14    = 0x000EU, //!< Receive FIFO 14/16 full
    I2C_FIFO_RX15    = 0x000FU, //!< Receive FIFO 15/16 full
    // I2C_FIFO_RX16    = 0x0010U, //!< Receive FIFO full
    I2C_FIFO_RXFULL = 0x000FU //!< Receive FIFO full
} I2C_RxFIFOLevel;

//*****************************************************************************
//
//! Values that can be passed to I2C_setBitCount() as the \e size parameter.
//
//*****************************************************************************
typedef enum
{
    I2C_BITCOUNT_1 = 1U, //!< 1 bit per data byte
    I2C_BITCOUNT_2 = 2U, //!< 2 bits per data byte
    I2C_BITCOUNT_3 = 3U, //!< 3 bits per data byte
    I2C_BITCOUNT_4 = 4U, //!< 4 bits per data byte
    I2C_BITCOUNT_5 = 5U, //!< 5 bits per data byte
    I2C_BITCOUNT_6 = 6U, //!< 6 bits per data byte
    I2C_BITCOUNT_7 = 7U, //!< 7 bits per data byte
    I2C_BITCOUNT_8 = 0U  //!< 8 bits per data byte
} I2C_BitCount;

//*****************************************************************************
//
//! Values that can be passed to I2C_setAddressMode() as the \e mode parameter.
//
//*****************************************************************************
typedef enum
{
    I2C_ADDR_MODE_7BITS  = 0x0000U, //!< 7-bit address
    I2C_ADDR_MODE_10BITS = 0x0100U  //!< 10-bit address
} I2C_AddressMode;

//*****************************************************************************
//
//! Values that can be passed to I2C_setEmulationMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! If SCL is low, keep it low. If high, stop when it goes low again.
    I2C_EMULATION_STOP_SCL_LOW = 0x0000U,
    //! Continue I2C operation regardless
    I2C_EMULATION_FREE_RUN = 0x4000U
} I2C_EmulationMode;

//*****************************************************************************
//
//! Values that can be passed to I2C_initController() as the \e dutyCycle
//! parameter.
//
//*****************************************************************************
typedef enum
{
    I2C_DUTYCYCLE_33, //!< Clock duty cycle is 33%
    I2C_DUTYCYCLE_50  //!< Clock duty cycle is 55%
} I2C_DutyCycle;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an I2C base address.
//!
//! \param base is the base address of the I2C instance used.
//!
//! This function determines if a I2C module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool I2C_isBaseValid(uint32_t base)
{
    return ((base == I2CA_BASE));
}
#endif

//*****************************************************************************
//
//! Enables the I2C module.
//!
//! \param base is the base address of the I2C instance used.
//!
//! This function enables operation of the I2C module.
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_enableModule(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    HWREGH(base + I2C_O_MDR) |= I2C_MDR_IRS;
}

//*****************************************************************************
//
//! Disables the I2C module.
//!
//! \param base is the base address of the I2C instance used.
//!
//! This function disables operation of the I2C module.
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_disableModule(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    HWREGH(base + I2C_O_MDR) &= ~(I2C_MDR_IRS);
}

//*****************************************************************************
//
//! Enables the transmit and receive FIFOs.
//!
//! \param base is the base address of the I2C instance used.
//!
//! This functions enables the transmit and receive FIFOs in the I2C.
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_enableFIFO(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Enable the FIFO.
    //
    HWREGH(base + I2C_O_FFTX) |= I2C_FFTX_I2CFFEN | I2C_FFTX_TXFFRST;
    HWREGH(base + I2C_O_FFRX) |= I2C_FFRX_RXFFRST;
}

//*****************************************************************************
//
//! Disables the transmit and receive FIFOs.
//!
//! \param base is the base address of the I2C instance used.
//!
//! This functions disables the transmit and receive FIFOs in the I2C.
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_disableFIFO(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Disable the FIFO.
    //
    HWREGH(base + I2C_O_FFTX) &= ~(I2C_FFTX_I2CFFEN | I2C_FFTX_TXFFRST);
    HWREGH(base + I2C_O_FFRX) &= ~I2C_FFRX_RXFFRST;
}

//*****************************************************************************
//
//! Sets the FIFO level at which interrupts are generated.
//!
//! \param base is the base address of the I2C instance used.
//! \param txLevel is the transmit FIFO interrupt level, specified as
//! \b I2C_FIFO_TX0, \b I2C_FIFO_TX1, \b I2C_FIFO_TX2, . . . or
//! \b I2C_FIFO_TX16.
//! \param rxLevel is the receive FIFO interrupt level, specified as
//! \b I2C_FIFO_RX0, \b I2C_FIFO_RX1, \b I2C_FIFO_RX2, . . . or
//! \b I2C_FIFO_RX16.
//!
//! This function sets the FIFO level at which transmit and receive interrupts
//! are generated.  The transmit FIFO interrupt flag will be set when the FIFO
//! reaches a value less than or equal to \e txLevel.  The receive FIFO
//! flag will be set when the FIFO reaches a value greater than or equal to
//! \e rxLevel.
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_setFIFOInterruptLevel(
    uint32_t base, I2C_TxFIFOLevel txLevel, I2C_RxFIFOLevel rxLevel)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Set the FIFO interrupt levels.
    //
    HWREGH(base + I2C_O_FFTX)
        = (HWREGH(base + I2C_O_FFTX) & (~I2C_FFTX_TXFFIL_M)) | (uint16_t)txLevel;
    HWREGH(base + I2C_O_FFRX)
        = (HWREGH(base + I2C_O_FFRX) & (~I2C_FFRX_RXFFIL_M)) | (uint16_t)rxLevel;
}

//*****************************************************************************
//
//! Gets the FIFO level at which interrupts are generated.
//!
//! \param base is the base address of the I2C instance used.
//! \param txLevel is a pointer to storage for the transmit FIFO level,
//! returned as one of \b I2C_FIFO_TX0, \b I2C_FIFO_TX1,
//! \b I2C_FIFO_TX2, . . . or \b I2C_FIFO_TX16.
//! \param rxLevel is a pointer to storage for the receive FIFO level,
//! returned as one of \b I2C_FIFO_RX0, \b I2C_FIFO_RX1,
//! \b I2C_FIFO_RX2, . . . or \b I2C_FIFO_RX16.
//!
//! This function gets the FIFO level at which transmit and receive interrupts
//! are generated.  The transmit FIFO interrupt flag will be set when the FIFO
//! reaches a value less than or equal to \e txLevel.  The receive FIFO
//! flag will be set when the FIFO reaches a value greater than or equal to
//! \e rxLevel.
//!
//! \return None.
//
//*****************************************************************************
static inline void I2C_getFIFOInterruptLevel(
    uint32_t base, I2C_TxFIFOLevel *txLevel, I2C_RxFIFOLevel *rxLevel)
{
    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Extract the transmit and receive FIFO levels.
    //
    *txLevel = (I2C_TxFIFOLevel)(HWREGH(base + I2C_O_FFTX) & I2C_FFTX_TXFFIL_M);
    *rxLevel = (I2C_RxFIFOLevel)(HWREGH(base + I2C_O_FFRX) & I2C_FFRX_RXFFIL_M);
}

//*****************************************************************************
//
//! Get the transmit FIFO status
//!
//! \param base is the base address of the I2C instance used.
//!
//! This function gets the current number of words in the transmit FIFO.
//!
//! \return Returns the current number of words in the transmit FIFO specified
//! as one of the following:
//! \b I2C_FIFO_TX0, \b I2C_FIFO_TX1, \b I2C_FIFO_TX2, \b I2C_FIFO_TX3,
//! ..., or \b I2C_FIFO_TX16
//
//*****************************************************************************
static inline I2C_TxFIFOLevel I2C_getTxFIFOStatus(uint32_t base)
{
    uint16_t level;

    //
    // Check the arguments.
    //
    ASSERT(I2C_isBaseValid(base));

    //
    // Get the current FIFO status
    //
    level = ((HWREGH(base + I2C_O_FFTX) & I2C_FFTX_TXFFST_M) >> I2C_FFTX_TXFFST_S);

